// 1) Создайте пустой объект.
// 2) Добавьте несколько свойств со значениями разных типов.
// 3) Добавьте метод.
// 4) Удалите одно из созданных свойств.


// 1) создаем пустой объект 

const object = {};

// или вторым способом

const object_12 = new Object();

// 2) Добавляем несколько свойств со значениями разных типов.

const object_2 = {

    a: 'hello, мир',
    b: 1337,

};

// 3) Добавляем метод.

const object_3 = {
    a: 1,
    c: function() {
        console.log(28.03.2002);
    },
};

// 4) Удаляем одно из созданных свойств.

const object_3 = {
    a: 1,
    c: function() {
        console.log(28.03.2002);
    },
};

const object_3 = {a: 1};
delete object_3.a; 
console.log(obj) 




